{
  "main": {
    "name":"Hi, I'm Odwa Nolusiba Ntloko",
    "description":"And I'm a Software engineer. This site tells you a biiiit more about me ... :) ",
    "image":"profilepic.png",
    "bio":"I’m a software engineer who loves working with the full technology stack, from front to backend and everything inbetween. I enjoy seeing myself do magic with code and the reactions of the people I'm working with when they see my work. Most importantly, I looove solving problems and I'm always eager to learn new languages/frameworks. Overall I’m passionate about technology and excited about the future.",
    "hobbies":"I'm born and raised in Cape Town. One of my favourite things to do in the world is going to the beach and being surrounded by water. I also enjoy visiting our local vineyards and going for wine tastings. I love-love-love attending concerts/live performances. But with concerts not really being a thing anymore, my new favourite love is horseback riding.  I enjoy attending tech meetups and being part of the bigger tech community.",
    "contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
    "email": "ntlokodwa@gmail.com",
    "phone": "",
    "github":"https://github.com/odwantloko",
    "project":"https://github.com/odwantloko/odwa-ntloko.git",
    "address":{
      "street":"Cape Town Area",
      "city":"",
      "state":"",
      "zip": ""
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload":"http://timbakerdev.com",
    "social":[
      {
        "name":"facebook",
        "url":"https://www.facebook.com/odwa.ntloko",
        "className":"fa fa-facebook"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/odwa-ntloko-4b3b77145/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"https://www.instagram.com/odwa_ntloko/?hl=en",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/odwantloko",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Here you can create a short write-up of your skills to show off to employers",
    "work":[
      {
        "company":"Zulzi on Demand",
        "title":"Intermediate Software Engineer",
        "years":"Nov 2021 - Present",
        "description":"In my current role, I work on Go-lang microservices and some react portals for the Checkers Sixty60 app. I deliver on my sprint targets while maintaining coding standards."
      },
      {
        "company":"Vodacom (PTY) LTD",
        "title":"Specialist: Automation & Transformation Developer",
        "years":"Mar 2021 - Oct 2021",
        "description":"In this role I was a software developer who continues to work across the fullstack of web applications. I develop web applications using reactJS for their front-end and build microservices using nodeJS. I perform code reviews to ensure that the standards of our software development team are being met. I provide support for new people who join the team and help them get started in our team."
      },
      {
        "company":"Vodacom (PTY) LTD",
        "title":"Discover Graduate Trainee - Software Engineer ",
        "years":"Feb 2019 - Feb 2021",
        "description":"During the program I was exposed to different parts and technologies in the business. The first part of the business I was exposed to was our RPA division where I learnt process behind automating repetive tasks for 3 months. I was then exposed to the financial services industry and developed an application which reduced the turn around time of short term insurance claims from 2 hours to 15 minutes. I spent 3 months in the financial services team. I then worked worked with the Vodacom chatbot team and supporting tribe teams for the rest of the 2 year program. I started out working on the reporting for the team building angular dashboard views for different stakeholders. I have since been building other types of internal web application tools and their backends for stakeholders within our tribe. I've also built a few of the chatbot microservices depending on the business needs. The tech stack I've been using is ReactJS, NodeJS, Oracle SQL developer, bitbucket and redhat openshift."
      },
      {
        "company":"ACI World Wide",
        "title":"Intern Associate Software Engineer",
        "years":"Nov 2018 - Jan 2019",
        "description":"I had to create a Django CRUD application from start to finish (Fullstack). I started by designing the database structure for how the data would be stored. The data was in the form of a CSV and an Excel file which was related to eachother. I then created python scripts to merge the 2 data sources into a single data-structure and then wrote the data to the database structure I designed in the beginning. This was a Microsoft SQL server database. A user was then able to Create, Read, Update and Delete the data through the web-interface. The REST methods were defined within the Django part of the project."
      }
    ],
    "education":[
      {
        "school":"University of Cape Town",
        "degree":"BSc Computer Science and Computer Engineering",
        "graduated":"2015-2018",
        "experience":"My first year at varsity was very challenging. In fact, I even had 2 \"first years\". I spent most of my 1st first year being overwhelmed by the environment, the workload and by the fact that it felt like I was the only one in my class that hadn't done any programming in high school. At some point, I even felt that maybe Tech wasn't for me and that the university had made a mistake accepting me to study Computer Science. However, towards the end of the year, the more I met people who felt the same way I did, the more 'normal' I felt, and the more I was able to overcome my anxieties and perform better in my academics. By the end of the following year, I obtained a distinction in one of my most challenging subjects and even became a tutor for it. ",
        "e1": "\nI then joined the UCT Developer Society and the Women in Computer Science Society. Where I would meet-up with other aspiring developers and talk about the future. I also became a Computer Science Mentor to try and help first years adjust to university as smoothly as possible",
        "e2":"Overall, I had a lot of ups and downs at university, but it was one of the best experiences and learning curves in my life.",
        "description":"I learnt a lot during this degree so I won't even try to name everything. The languages/tools I used include Java; Python; C & C++; SQL; Assembly. I also did a Machine Learning module."
      }

    ],
    "skills":[
      {
        "name":"Java",
        "level":"83%"
      },
      {
        "name":"Golang",
        "level":"75%"
      },
      {
        "name":"Javascript",
        "level":"80%"
      },
      {
        "name":"NodeJS",
        "level":"85%"
      },
      {
        "name":"Typescript",
        "level":"85%"
      },
      {
        "name":"Python",
        "level":"80%"
      },
      {
        "name":"Angular",
        "level":"87%"
      },
      {
        "name":"ReactJS",
        "level":"87%"
      },
      {
        "name":"ReactNative",
        "level":"55%"
      },
      {
        "name":"SQL",
        "level":"80%"
      },
      {
        "name":"NoSQL (e.g. Firebase & MongoDB)",
        "level":"95%"
      },
      {
        "name":"AGILE way of work",
        "level":"100%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Rise Afrika Rise",
        "category":"A community project's website",
        "image":"riseafrika.png",
        "url":"https://rise-afrika-rise.web.app/"
      },
      {
        "title":"Oval North High School",
        "category":"A school website I was working on just before COVID-19 hit. Still waiting for images and outstanding data",
        "image":"school.png",
        "url":"https://oval-north-high-schoool.web.app/"
      },
      {
        "title":"Thenjiwe Deliveries",
        "category":"An Online Shoppinp Platform for resellers wanting to buy from factories",
        "image":"thenji.jpg",
        "url":"https://thenjiwe-trading.web.app/"
      },
      {
        "title":"Thenjiwe Admin",
        "category":"The admin part used by the website owner to update the thenjiwe deliveries data",
        "image":"admin.png",
        "url":"https://thenjiwe-admin.web.app/"
      },
      {
        "title":"",
        "category":"I'm currently working on more projects, watch this space!",
        "image":"more.jpg",
        "url":""
      }
  
    ]
  }
}
